package com.javaSort;

/**
 * @author Shiwen Li CN116237626
 * @create 2021-04-30 09:51
 * @note
 */
public class a_overview {
    /*
    排序算法说明
    0.1 排序的定义
    对一序列对象根据某个关键字进行排序。

    0.2 术语说明
    稳定：如果a原本在b前面，而a=b，排序之后a仍然在b的前面；
    不稳定：如果a原本在b的前面，而a=b，排序之后a可能会出现在b的后面；
    内排序：所有排序操作都在内存中完成；
    外排序：由于数据太大，因此把数据放在磁盘中，而排序通过磁盘和内存的数据传输才能进行；
    时间复杂度： 一个算法执行所耗费的时间。
    空间复杂度：运行完一个程序所需内存的大小。
    0.3 算法总结
    图a_3
    图片名词解释：
    n: 数据规模
    k: “桶”的个数
    In-place: 占用常数内存，不占用额外内存
    Out-place: 占用额外内存
    0.5 算法分类
    图a_5
     */
}
